app/views/prints/index.html.erb

<div class="grid-column">
<!-- if current_user.print.count == 0 -->
---
SELECT "prints".* FROM "prints" WHERE "prints"."user_id" = $1  [["user_id", 1]]