app/views/prints/show.html.erb

<h2>Comments:</h2>
<% @print.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."print_id" = $1  [["print_id", 10]]