app/controllers/comments_controller.rb

  def create
    @print = Print.find(params[:print_id])

    # you can shorten the following three lines to one line like so:
    # (provided you follow the advice below in `comment_params`

    # @comment = current_user.comments.create(comment_params)
    @comment = @print.comments.create(comment_params)
---
INSERT INTO "comments" ("name", "text", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "fajfa'jfdsf"], ["text", "fafadfd"], ["post_id", 3], ["created_at", "2015-07-30 05:14:27.829887"], ["updated_at", "2015-07-30 05:14:27.829887"]]

  def destroy
    @print = Print.find(params[:print_id])
    @comment = @print.comments.find(params[:id])
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]