app/controllers/prints_controller.rb

SELECT "prints".* FROM "prints" WHERE "prints"."user_id" = $1  [["user_id", 1]]
---
  def index
    @prints = Print.all.order(:id).reverse_order
    @variousUserPrints = Print.where.not(user_id: current_user.id).reverse_order

SELECT  "prints".* FROM "prints" WHERE "prints"."id" = $1 LIMIT 1  [["id", 10]]
---
  def show
    @print = Print.find(params[:id])